cache/SoapHttp-example.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://localhost:8888/index.php" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" name="SoapHttp" targetNamespace="http://localhost:8888/index.php"><types><xsd:schema targetNamespace="http://localhost:8888/index.php"><xsd:complexType name="SoapHttpHeader"><xsd:all><xsd:element name="Key" type="xsd:string" nillable="true"/><xsd:element name="Value" type="xsd:string" nillable="true"/></xsd:all></xsd:complexType><xsd:complexType name="ArrayOfSoapHttpHeader"><xsd:sequence><xsd:element name="item" type="tns:SoapHttpHeader" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType><xsd:complexType name="SoapHttpResponse"><xsd:all><xsd:element name="RequestUrl" type="xsd:string" nillable="true"/><xsd:element name="RequestMethod" type="xsd:string" nillable="true"/><xsd:element name="RequestBody" type="xsd:string" nillable="true"/><xsd:element name="RequestHeaders" type="tns:ArrayOfSoapHttpHeader" nillable="true"/><xsd:element name="ResponseText" type="xsd:string" nillable="true"/><xsd:element name="ResponseJson" type="xsd:string" nillable="true"/></xsd:all></xsd:complexType></xsd:schema></types><portType name="SoapHttpPort"><operation name="SoapHttpRequest"><documentation>This method forwards the request and returns the http response</documentation><input message="tns:SoapHttpRequestIn"/><output message="tns:SoapHttpRequestOut"/></operation></portType><binding name="SoapHttpBinding" type="tns:SoapHttpPort"><soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="SoapHttpRequest"><soap:operation soapAction="http://localhost:8888/index.php#SoapHttpRequest"/><input><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://localhost:8888/index.php"/></input><output><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://localhost:8888/index.php"/></output></operation></binding><service name="SoapHttpService"><port name="SoapHttpPort" binding="tns:SoapHttpBinding"><soap:address location="http://localhost:8888/index.php"/></port></service><message name="SoapHttpRequestIn"><part name="Url" type="xsd:string"/><part name="Method" type="xsd:string"/><part name="Body" type="xsd:string"/><part name="Headers" type="tns:ArrayOfSoapHttpHeader"/></message><message name="SoapHttpRequestOut"><part name="return" type="tns:SoapHttpResponse"/></message></definitions>
